#include <stdio.h> //เรียกใช้ไลบรารี


int main() { //เปิดจุดเริ่มต้นโปรแกรม และ เปิดบล็อกคำสั่ง
    
    printf("a=%6.3f%%\n", 0.617);   //แสดงผลตัวแปล แบบทศนิยม ขนาด 6 ช่อง ทศนิยม 3 ตำแหน่ง โดยข้อมูลชิดฝั่งขวา
    printf("b=%4d%%\n", 25);        //แสดงผลตัวแปล แบบจำนวนจริง ขนาด 4 ช่อง โดยข้อมูลชิดฝั่งขวา
    printf("c =%6.3f%%\n", 19.000); //แสดงผลตัวแปล แบบทศนิยม ขนาด 6 ช่อง ทศนิยม 3 ตำแหน่ง โดยข้อมูลชิดฝั่งขวา
    printf("d  =%-2d%%\n",9);       //แสดงผลตัวแปล แบบจำนวนจริง ขนาด 2 ช่อง โดยข้อมูลชิดฝั่งซ้าย
    printf("e=%6.3f%%\n", 124.555); //แสดงผลตัวแปล แบบทศนิยม ขนาด 6 ช่อง ทศนิยม 3 ตำแหน่ง โดยข้อมูลชิดฝั่งขวา
    printf("f=%5.3f%%\n", 0.001);   //แสดงผลตัวแปล แบบทศนิยม ขนาด 5 ช่อง ทศนิยม 3 ตำแหน่ง โดยข้อมูลชิดฝั่งขวา
return 0;  //ส่งค่ากลับว่าไม่มีข้อผิดพลาด

} //ปิดบล็อกคำสั่ง